;;; support-daijirin.el --- support file for 『大辞林』

;; This file has been excerpted from the following URL.
;;
;; http://www31.ocn.ne.jp/~h_ishida/EBPocket.html
;;
;; It is freely re-deistributable and editable file.

;; 大辞林第二版 EPWING (EBWin用Large版)
;;	Author	:	hishida
;;	Date	:	Ver.2.0	2007.9.27	全漢字対応版
;;
;;
;;	◎このファイルの見方
;;		GAIJI	EPWINGの外字(書籍定義文字)です。hXXXXは半角、zXXXXは全角を表します。
;;		unicode	対応するUnicodeです。uXXXX(16進数)で表記します。
;;			2文字以上の合字の場合、uXXXX,uXXXXのようにカンマ区切りで続けて記述します。
;;		ascii	Unicodeが定義されない場合の代替文字です。EBWinではクリップボードコピーで使用します。
;;		#で始まる行はコメントです。行内の # から末尾まではコメントです。
;;		(未使用)	『大辞林』本文中で出現しない未使用の外字です。
;;
;;	◎外字調査について
;;		使用したCD-ROMは、『三省堂 スーパー大辞林 CD-ROM』です。
;;		全角外字1499文字中、『大辞林』本文に現れる1369文字を調査しました。
;;
;;		Unicodeが見つけられなかった漢字は × を付記しています。
;;		CJK漢字拡張-Aの文字は (Ext-A)、CJK漢字拡張-Bの文字は (Ext-B)とコメントしています。
;;		(Ext-A)*、(Ext-B)* のように*のついた文字は、JIS2004に収録されているため、
;;		MSゴシック・明朝ver5.0やメイリオフォント環境なら表示することができます。
;;		CJK漢字拡張-A,Bの全ての文字を表示するには、MingLiU-ExtBなどのフォントが必要です。
;;
;;	◎二次使用について
;;		このファイルの一部、または全部を、自由に改変、再利用、再配布することを許可します。
;;
;;	◎使用上の注意
;;		WindowsXP SP2のMS UI Gothicでの使用を想定しています。
;;		MS UI Gothicに収録されていない文字はコメントにしています。
;;
;;ebcode	unicode	ascii	#	char	comment

;;; Code:
(require 'lookup)

(let 
  ((encoded-daijirin-gaiji-table
      '(
        ("hc121" "á" "a")	;; a	
        ("hc122" "à" "a")	;; a	
        ("hc123" "â" "a")	;; a	
        ("hc124" "ä" "a")	;; a	
        ("hc125" "ã" "a")	;; a	
        ("hc126" "ā" "a")	;;  	
        ("hc127" "é" "e")	;; e	
        ("hc128" "è" "e")	;; e	
        ("hc129" "ê" "e")	;; e	
        ("hc12a" "ë" "e")	;; e	
        ("hc12b" "ē" "e")	;;  	
        ("hc12c" "í" "i")	;; i	
        ("hc12d" "î" "i")	;; i	
        ("hc12e" "ï" "i")	;; i	
        ("hc12f" "ñ" "n")	;; n	
        ("hc130" "ó" "o")	;; o	
        ("hc131" "ò" "o")	;; o	
        ("hc132" "ô" "o")	;; o	
        ("hc133" "ö" "o")	;; o	
        ("hc134" "ř" "r")	;;  	
        ("hc135" "ú" "u")	;; u	
        ("hc136" "ü" "u")	;; u	
        ("hc137" "~")		;; ~	
        ("hc138" "ç" "c")	;; c	
        ("hc139" "ˇ")		;;  	
        ("hc13a" "ɡ")		;;  	
        ("hc13b" "ŋ")		;;  	
        ("hc13c" "ʒ")		;;  	
        ("hc13d" "ʃ")		;;  	
        ("hc13e" "ɔ")		;;  	
        ("hc13f" "ð")		;; d	
        ("hc140" "Á" "A")	;; A	
        ("hc141" "Í" "I")	;; I	
        ("hc142" "Ú" "U")	;; U	
        ("hc143" "É" "E")	;; E	
        ("hc144" "Ó" "O")	;; O	
        ("hc145" "À" "A")	;; A	
        ("hc146" "È" "E")	;; E	
        ("hc147" "Ò" "O")	;; O	
        ("hc148" "ì" "i")	;; i	
        ("hc149" "ù" "u")	;; u	
        ("hc14a" "ý" "y")	;; y	
        ("hc14b" "y" "y")	;; y`	
        ("hc14c" "ɑ")		;;  	
        ("hc14d" "ə")		;;  	
        ("hc14e" nil)		;;  イタリック	
        ("hc14f" "ɛ")		;;  	
        ("hc150" "θ")		;; θ	
        ("hc151" "ʌ")		;;  	
        ("hc152" "ɑ")		;;  ´	
        ("hc153" "ə")		;;  ´	
        ("hc154" "ɔ")		;;  ´	
        ("hc155" "ɛ")		;;  ´	
        ("hc156" "ʌ")		;;  ´	
        ("hc157" "ɑ")		;;  `	
        ("hc158" "ə")		;;  `	
        ("hc159" "ɔ")		;;  `	
        ("hc15a" "ɛ")		;;  `	
        ("hc15b" "ʌ")		;;  `	
        ("hc15c" "æ" "ae")	;; a	
        ("hc15d" "ǽ" "ae")	;;  	
        ("hc15e" "æ" "ae")	;; a`	
        ("hc15f" "Æ" "AE")	;; A	
        ("hc160" "ɑ")		;;  ~	
        ("hc161" "å" "a")	;; a	
        ("hc162" "˘")		;;  	
        ("hc163" "ă" "a")	;;  	
        ("hc164" "ŏ" "o")	;;  	
        ("hc165" "ĭ" "i")	;;  	
        ("hc166" "V́" "V")	;; V´	
        ("hc167" "T́" "T")	;; T´	
        ("hc168" nil)		;;  イタリック	
        ("hc169" "ɔ̃")		;;  ~	
        ("hc16b" nil)		;;  イタリック	
        ("hc16c" nil "-")	;; -´	
        ("hc16d" nil "-")	;; -`	
        ("hc16e" nil "a")	;; a~´	
        ("hc16f" nil)		;;  イタリック	
        ("hc170" nil "m")	;; m。	
        ("hc171" nil "m")	;; m´。	
        ("hc172" nil)		;; 	
        ("hc173" nil)		;; ~´	
        ("hc174" nil)		;;  ~´	
        ("hc175" nil "ae")	;; ae~´	
        ("hc176" nil)		;;  ~´	
        ("hc177" "ć")		;;  	
        ("hc178" nil)		;;  ~`	
        ("hc179" nil)		;;  ~`	
        ("hc17a" nil "ae")	;; ae~`	
        ("hc17b" "û" "u")	;; u^	
        ("hc17c" "Ý" "Y")	;; Y	
        ("hc17d" nil)		;;  ~`	
        ("hc17e" "Ḿ" "M")	;; M´	
        ("hc221" nil)		;;  ~	
        ("hc222" nil "+")	;; 	
        ("hc223" nil "X")	;; 	
        ("hc224" "ō" "o")	;;  	
        ("hc225" "ğ" "g")	;; g 	
        ("hc226" nil "A")	;; イタリック	
        ("hc227" nil "B")	;; イタリック	
        ("hc228" nil "D")	;; イタリック	
        ("hc229" "Ḍ" "D")	;; D.	
        ("hc22a" nil "E")	;; イタリック	
        ("hc22b" nil "F")	;; イタリック	
        ("hc22c" nil "G")	;; イタリック	
        ("hc22d" nil "H")	;; イタリック	
        ("hc22e" "Ḥ" "H")	;; H.	
        ("hc22f" nil "L")	;; イタリック	
        ("hc230" nil "M")	;; イタリック	
        ("hc231" nil "N")	;; イタリック	
        ("hc232" nil "P")	;; イタリック	
        ("hc233" nil "Q")	;; イタリック	
        ("hc234" nil "R")	;; イタリック	
        ("hc235" "Ṛ" "R")	;; R.	
        ("hc236" nil "S")	;; イタリック	
        ("hc237" "Ṣ" "S")	;; S.	
        ("hc238" nil "T")	;; イタリック	
        ("hc239" nil "V")	;; イタリック	
        ("hc23a" "Ẓ" "Z")	;; Z.	
        ("hc23b" nil "a")	;; イタリック	
        ("hc23c" "ą" "a")	;; a 	
        ("hc23d" nil "b")	;; イタリック	
        ("hc23e" nil "c")	;; イタリック	
        ("hc23f" nil "d")	;; イタリック	
        ("hc240" "ḍ" "d")	;; d.	
        ("hc241" nil "e")	;; イタリック	
        ("hc242" "ę" "e")	;; e 	
        ("hc243" nil "f")	;; イタリック	
        ("hc244" nil "g")	;; イタリック	
        ("hc245" nil "h")	;; イタリック	
        ("hc246" "ḥ" "h")	;; h.	
        ("hc247" nil "i")	;; イタリック	
        ("hc248" "ị" "i")	;; i.	
        ("hc249" nil "k")	;; イタリック	
        ("hc24a" nil "l")	;; イタリック	
        ("hc24b" nil "m")	;; 	
        ("hc24c" "ṃ" "m")	;; m.	
        ("hc24d" nil "n")	;; イタリック	
        ("hc24e" "ṇ" "n")	;; n.	
        ("hc24f" nil "o")	;; イタリック	
        ("hc250" nil "p")	;; イタリック	
        ("hc251" nil "q")	;; イタリック	
        ("hc252" nil "r")	;; イタリック	
        ("hc253" "ṛ" "r")	;; r.	
        ("hc254" nil "s")	;; イタリック	
        ("hc255" "ş" "s")	;; s，	
        ("hc256" "ṣ" "s")	;; s.	
        ("hc257" nil "t")	;; イタリック	
        ("hc258" "ṭ" "t")	;; t.	
        ("hc259" nil "v")	;; イタリック	
        ("hc25a" nil "x")	;; イタリック	
        ("hc25b" nil "y")	;; イタリック	
        ("hc25c" nil "z")	;; イタリック	
        ("hc25d" "ẓ" "z")	;; z.	
        ("hc25e" "İ" "I")	;;  	
        ("hc25f" "ṁ" "m")	;; m 	
        ("hc260" "ṅ" "n")	;; n 	
        ("hc261" "ż" "z")	;;  	
        ("hc262" "Ś" "S")	;;  	
        ("hc263" "ć" "c")	;;  	
        ("hc264" "ń" "n")	;;  	
        ("hc265" "ś" "s")	;;  	
        ("hc266" "ý" "y")	;; y	
        ("hc267" "ź" "z")	;;  	
        ("hc268" "ì" "i")	;; i	
        ("hc269" "Ä" "A")	;; A	
        ("hc26a" "Ö" "O")	;; O	
        ("hc26b" "Ü" "U")	;; U	
        ("hc26c" "ÿ" "y")	;; y	
        ("hc26d" "Â" "A")	;; A	
        ("hc26e" nil "o")	;; o^.	
        ("hc26f" "û" "u")	;; u	
        ("hc270" "Ā" "A")	;;  	
        ("hc271" "Ē" "E")	;;  	
        ("hc272" "Ī" "I")	;;  	
        ("hc273" "Ō" "O")	;;  	
        ("hc274" "Ū" "U")	;;  	
        ("hc275" "ī" "i")	;;  	
        ("hc276" "n̄" "n")	;; n 	
        ("hc277" "p̄" "p")	;; p 	
        ("hc278" "ū" "u")	;;  	
        ("hc279" "ȳ" "y")	;; y 	
        ("hc27a" "Ł" "L")	;;  	
        ("hc27b" "ł" "l")	;;  	
        ("hc27c" "ø" "o")	;; o	
        ("hc27d" "ĩ" "i")	;;  	
        ("hc27e" "õ" "o")	;; o	
        ("hc322" nil "R")	;; R°	
        ("hc323" "º" "0")	;; o	
        ("hc324" "½" "1/2")	;;  	
        ("hc325" nil "1/3")	;; 	
        ("hc326" "¹" "1")	;; 1	
        ("hc327" "²" "2")	;; 2	
        ("hc328" "¾" "3/4")	;;  	
        ("hc329" "³" "3")	;; 3	
        ("hc32a" nil "4")	;; 上付	
        ("hc32b" nil "5")	;; 上付	
        ("hc32c" nil "6")	;; 上付	
        ("hc32d" nil "7")	;; 上付	
        ("hc32e" nil "8")	;; 上付	
        ("hc32f" nil "9")	;; 上付	
        ("hc330" nil "M")	;; 上付	
        ("hc331" nil "a/b")	;; 	
        ("hc332" nil "b")	;; 上付	
        ("hc333" nil)		;; 	
        ("hc334" "ɟ")		;;  	
        ("hc335" nil "i")	;; 上付	
        ("hc336" nil "m")	;; 上付	
        ("hc337" nil "n")	;; 上付	
        ("hc338" nil "r")	;; 上付	
        ("hc339" nil "t")	;; 上付	
        ("hc33a" nil "x")	;; 上付	
        ("hc33b" nil)		;; 	
        ("hc33c" nil "y")	;; 上付	
        ("hc33d" nil "+")	;; 上付	
        ("hc33e" nil "-")	;; 上付	
        ("hc33f" nil "+-")	;; ±	
        ("hc340" nil)		;; 	
        ("hc341" nil "0")	;; 下付	
        ("hc342" nil "1")	;; 下付	
        ("hc343" nil "2")	;; 下付	
        ("hc344" nil "3")	;; 下付	
        ("hc345" nil "4")	;; 下付	
        ("hc346" nil "5")	;; 下付	
        ("hc347" nil "6")	;; 下付	
        ("hc348" nil "7")	;; 下付	
        ("hc349" nil "8")	;; 下付	
        ("hc34a" nil "9")	;; 下付	
        ("hc34b" nil "A")	;; 下付	
        ("hc34c" nil "a")	;; 下付(α )	
        ("hc34d" nil "b")	;; 下付	
        ("hc34e" nil "i")	;; 下付	
        ("hc34f" nil "k")	;; 下付	
        ("hc350" nil "m")	;; 下付	
        ("hc351" nil "n")	;; 下付	
        ("hc352" nil "r")	;; 下付	
        ("hc353" nil "x")	;; 下付	
        ("hc354" nil "一レ")	;; 	
        ("hc355" nil "+")	;; 	
        ("hc356" nil "-")	;; 	
        ("hc357" nil "I")	;; 	
        ("hc358" nil "W")	;; 	
        ("hc359" nil "Z")	;; 	
        ("hc35a" "g̀" "g")	;; g`	
        ("hc35c" nil "$")	;; 	
        ("hc35d" nil "C")	;; 	
        ("hc360" nil "レ")	;; 	
        ("hc364" nil "一")	;; 	
        ("hc365" nil "下")	;; 	
        ("hc366" nil "三")	;; 	
        ("hc367" nil "上")	;; 	
        ("hc368" nil "上レ")	;; 	
        ("hc369" nil "中")	;; 	
        ("hc36a" nil "ニ")	;; 	
        ("hc36b" "ĕ" "e")	;;  	
        ("hc36c" "Č" "C")	;;  	
        ("hc36d" "Š" "S")	;;  	
        ("hc36e" "ǎ" "a")	;;  	
        ("hc36f" "č" "c")	;;  	
        ("hc370" "ě" "e")	;;  	
        ("hc371" "ň" "n")	;;  	
        ("hc372" "ř" "r")	;;  	
        ("hc373" "š" "s")	;;  	
        ("hc374" "ž" "z")	;;  	
        ("hc375" "ヰ")		;; ヰ	
        ("hc376" "ヱ")		;; ヱ	
        ("hc377" "ɯ̈")		;;  ¨ 
        ("hc378" "ɰ")		;;  	
        ("hc379" nil "u")	;; u~'	
        ("hc37a" "ʔ")		;;  	
        ("hc37b" "ɦ")		;;  	
        ("hc37c" "ß" "ss")	;; s	
        ("hc37d" nil "I")	;; 	
        ("hc37e" nil "N")	;; 	
        ("hc421" "ɲ")		;;  	
        ("hc422" "ː")		;;  	
        ("hc423" nil)		;; 	

        ("za121" "仿")		;;  	
        ("za122" "佉")		;;  	
        ("za123" "侗")		;;  	
        ("za124" "倘")		;;  	
        ("za125" "偓")		;;  	
        ("za126" "傔")		;; 傔	
        ("za127" "傖")		;;  	
        ("za128" "僄")		;;  	
        ("za129" "僦")		;;  	
        ("za12a" "兕")		;;  	
        ("za12b" "凴")		;;  	
        ("za12c" "刁")		;;  	
        ("za12d" "剉")		;;  	
        ("za12e" "剗")		;;  	
        ("za12f" "劂")		;;  	
        ("za130" "劓")		;;  	
        ("za131" "勖")		;;  	
        ("za132" "卬")		;;  	
        ("za133" "厓")		;; 厓	
        ("za134" "厲")		;; 厲	
        ("za135" "呍")		;;  	
        ("za136" "吧")		;;  	
        ("za137" "咜")		;; 咜	
        ("za138" "呫")		;;  	
        ("za139" "呦")		;;  	
        ("za13a" "咿")		;;  	
        ("za13b" "咩")		;; 咩	
        ("za13c" "哿")		;; 哿	
        ("za13d" "唫")		;;  	
        ("za13e" "嘈")		;;  	
        ("za13f" "嘻")		;;  	
        ("za140" "噯")		;;  	
        ("za141" "噲")		;;  	
        ("za142" "嚚")		;;  	
        ("za143" "嚬")		;;  	
        ("za144" "圊")		;;  	
        ("za145" "圯")		;;  	
        ("za146" "坌")		;;  	
        ("za147" "埸")		;;  	
        ("za148" "埶")		;;  	
        ("za149" "埤")		;;  	
        ("za14a" "壔")		;;  	
        ("za14b" "壠")		;;  	
        ("za14c" "壚")		;;  	
        ("za14d" "虁")		;;  	
        ("za14e" "奝")		;; 奝	
        ("za14f" "奭")		;;  	
        ("za150" "姒")		;;  	
        ("za151" "婥")		;;  	
        ("za152" "婕")		;;  	
        ("za153" "孼")		;;  	
        ("za154" "尫")		;;  	
        ("za155" "屩")		;;  	
        ("za156" "崧")		;; 崧	
        ("za157" "嵆")		;;  	
        ("za158" "嶠")		;;  	
        ("za159" "嶸")		;; 嶸	
        ("za15a" "幘")		;;  	
        ("za15b" "庾")		;;  	
        ("za15c" "龐")		;;  	
        ("za15d" "弇")		;;  	
        ("za15e" "彀")		;;  	
        ("za15f" "彐")		;;  	
        ("za160" "彤")		;;  	
        ("za161" "徉")		;;  	
        ("za162" "徜")		;;  	
        ("za163" "徧")		;;  	
        ("za164" "忉")		;;  	
        ("za165" "忼")		;;  	
        ("za166" "忡")		;;  	
        ("za167" "怵")		;;  	
        ("za168" "悝")		;;  	
        ("za169" "惛")		;;  	
        ("za16a" "惕")		;; 惕	
        ("za16b" "惙")		;;  	
        ("za16c" "惲")		;; 惲	
        ("za16d" "愷")		;; 愷	
        ("za16e" "戕")		;;  	
        ("za16f" "扃")		;;  	
        ("za170" "扑")		;;  	
        ("za171" "拖")		;;  	
        ("za172" "拄")		;;  	
        ("za173" "捃")		;;  	
        ("za174" "挹")		;;  	
        ("za175" "摹")		;;  	
        ("za176" "撝")		;; 撝	
        ("za177" "撿")		;;  	
        ("za178" "昱")		;; 昱	
        ("za179" "晡")		;;  	
        ("za17a" "皙")		;; 皙	
        ("za17b" "腊")		;;  	
        ("za17c" "臏")		;;  	
        ("za17d" "杇")		;;  	
        ("za17e" "枘")		;;  	
        ("za221" "杻")		;;  	
        ("za222" "棰")		;;  	
        ("za223" "棖")		;;  	
        ("za224" "楨")		;; 楨	
        ("za225" "楣")		;;  	
        ("za226" "橛")		;;  	
        ("za227" "櫬")		;;  	
        ("za228" "欛")		;;  	
        ("za229" "歆")		;;  	
        ("za22a" "殂")		;;  	
        ("za22b" "殭")		;;  	
        ("za22c" "毱")		;;  	
        ("za22d" "氅")		;;  	
        ("za22e" "氐")		;;  	
        ("za22f" "氳")		;;  	
        ("za230" "淼")		;; 淼	
        ("za231" "沅")		;;  	
        ("za232" "沆")		;; 沆	
        ("za233" "汴")		;;  	
        ("za234" "沔")		;;  	
        ("za235" "泫")		;;  	
        ("za236" "泮")		;;  	
        ("za237" "洄")		;; 洄	
        ("za238" "洎")		;;  	
        ("za239" "洮")		;;  	
        ("za23a" "浥")		;;  	
        ("za23b" "淄")		;;  	
        ("za23c" "涿")		;;  	
        ("za23d" "淝")		;;  	
        ("za23e" "湜")		;; 湜	
        ("za23f" "渧")		;; 渧	
        ("za240" "滃")		;;  	
        ("za241" "漪")		;;  	
        ("za242" "漚")		;;  	
        ("za243" "漳")		;;  	
        ("za244" "澌")		;;  	
        ("za245" "瀆")		;;  	
        ("za246" "灝")		;;  	
        ("za247" "灤")		;;  	
        ("za248" "灎")		;;  	
        ("za249" "炫")		;; 炫	
        ("za24a" "炷")		;;  	
        ("za24b" "焮")		;;  	
        ("za24c" "焠")		;;  	
        ("za24d" "煜")		;; 煜	
        ("za24e" "煇")		;; 煇	
        ("za24f" "煆")		;; 煆	
        ("za250" "煨")		;;  	
        ("za251" "熅")		;;  	
        ("za252" "熒")		;;  	
        ("za253" "熇")		;;  	
        ("za254" "熳")		;;  	
        ("za255" "燋")		;;  	
        ("za256" "燁")		;; 燁	
        ("za257" "燾")		;; 燾	
        ("za258" "凞")		;;  	
        ("za259" "牓")		;;  	
        ("za25a" "牕")		;;  	
        ("za25b" "牖")		;;  	
        ("za25c" "犍")		;;  	
        ("za25d" "犛")		;;  	
        ("za25e" "猨")		;;  	
        ("za25f" "獐")		;;  	
        ("za260" "獷")		;; 獷	
        ("za261" "獼")		;;  	
        ("za262" "玕")		;;  	
        ("za263" "珉")		;; 珉	
        ("za264" "琦")		;; 琦	
        ("za265" "琚")		;;  	
        ("za266" "琨")		;;  	
        ("za267" "璆")		;;  	
        ("za268" "璉")		;; 璉	
        ("za269" "璟")		;; 璟	
        ("za26a" "璣")		;;  	
        ("za26b" "璘")		;;  	
        ("za26c" "璨")		;;  	
        ("za26d" "璿")		;;  	
        ("za26e" "瓚")		;;  	
        ("za26f" "畎")		;;  	
        ("za270" "痀")		;;  	
        ("za271" "痤")		;;  	
        ("za272" "瘖")		;;  	
        ("za273" "瘭")		;;  	
        ("za274" "皞")		;; 皞	
        ("za275" "盎")		;;  	
        ("za276" "盌")		;;  	
        ("za277" "盬")		;;  	
        ("za278" "盼")		;;  	
        ("za279" "眚")		;;  	
        ("za27a" "眙")		;;  	
        ("za27b" "睢")		;;  	
        ("za27c" "睟")		;;  	
        ("za27d" "睜")		;;  	
        ("za27e" "睽")		;;  	
        ("za321" "矰")		;;  	
        ("za322" "矻")		;;  	
        ("za323" "砭")		;;  	
        ("za324" "确")		;;  	
        ("za325" "磈")		;;  	
        ("za326" "磷")		;;  	
        ("za327" "禘")		;;  	
        ("za328" "秔")		;;  	
        ("za329" "窅")		;;  	
        ("za32a" "窠")		;;  	
        ("za32b" "窬")		;;  	
        ("za32c" "窳")		;;  	
        ("za32d" "竽")		;;  	
        ("za32e" "筠")		;;  	
        ("za32f" "簋")		;;  	
        ("za330" "簠")		;;  	
        ("za331" "籮")		;;  	
        ("za332" "糗")		;;  	
        ("za333" "糕")		;;  	
        ("za334" "糝")		;;  	
        ("za335" "紈")		;;  	
        ("za336" "紓")		;;  	
        ("za337" "絇")		;;  	
        ("za338" "絓")		;;  	
        ("za339" "絜")		;; 絜	
        ("za33a" "絺")		;;  	
        ("za33b" "綈")		;;  	
        ("za33c" "緂")		;;  	
        ("za33d" "縈")		;;  	
        ("za33e" "縕")		;;  	
        ("za33f" "縑")		;;  	
        ("za340" "縠")		;;  	
        ("za341" "縝")		;;  	
        ("za342" "繇")		;;  	
        ("za343" "繒")		;; 繒	
        ("za344" "繳")		;;  	
        ("za345" "罽")		;;  	
        ("za346" "罾")		;;  	
        ("za347" "翟")		;;  	
        ("za348" "翬")		;;  	
        ("za349" "耦")		;;  	
        ("za34a" "聱")		;;  	
        ("za34b" "艴")		;;  	
        ("za34c" "芎")		;;  	
        ("za34d" "芷")		;;  	
        ("za34e" "芮")		;;  	
        ("za34f" "苾")		;;  	
        ("za350" "茀")		;;  	
        ("za351" "荇")		;;  	
        ("za352" "荃")		;;  	
        ("za353" "莘")		;;  	
        ("za354" "蒯")		;;  	
        ("za355" "蓰")		;;  	
        ("za356" "蕓")		;; 蕓	
        ("za357" "蕙")		;; 蕙	
        ("za358" "蕞")		;;  	
        ("za359" "蕤")		;;  	
        ("za35a" "薏")		;;  	
        ("za35b" "藿")		;;  	
        ("za35c" "蘐")		;;  	
        ("za35d" "虗")		;;  	
        ("za35e" "虢")		;;  	
        ("za35f" "虬")		;;  	
        ("za360" "虯")		;;  	
        ("za361" "虺")		;;  	
        ("za362" "蚑")		;;  	
        ("za363" "蚱")		;;  	
        ("za364" "蜋")		;;  	
        ("za365" "蝘")		;;  	
        ("za366" "蝥")		;;  	
        ("za367" "螈")		;;  	
        ("za368" "螭")		;;  	
        ("za369" "蠲")		;;  	
        ("za36a" "裊")		;;  	
        ("za36b" "裛")		;;  	
        ("za36c" "褰")		;;  	
        ("za36d" "袪")		;;  	
        ("za36e" "裎")		;;  	
        ("za36f" "裱")		;;  	
        ("za370" "褚")		;;  	
        ("za371" "觔")		;;  	
        ("za372" "觖")		;;  	
        ("za373" "觳")		;;  	
        ("za374" "訕")		;;  	
        ("za375" "訢")		;;  	
        ("za376" "詘")		;;  	
        ("za377" "詡")		;;  	
        ("za378" "詹")		;; 詹	
        ("za379" "誾")		;; 誾	
        ("za37a" "豨")		;;  	
        ("za37b" "豳")		;;  	
        ("za37c" "貒")		;;  	
        ("za37d" "賙")		;;  	
        ("za37e" "贛")		;;  	
        ("za421" "跎")		;;  	
        ("za422" "跗")		;;  	
        ("za423" "踠")		;;  	
        ("za424" "踔")		;;  	
        ("za425" "踽")		;;  	
        ("za426" "蹢")		;;  	
        ("za427" "輞")		;;  	
        ("za428" "輭")		;;  	
        ("za429" "輶")		;;  	
        ("za42a" "轔")		;;  	
        ("za42b" "辧")		;; 辧	
        ("za42c" "辵")		;;  	
        ("za42d" "辶")		;;  	一点しんにょう
        ("za42e" "辶")		;;  	二点しんにょう
        ("za42f" "迤")		;;  	
        ("za430" "邅")		;;  	
        ("za431" "邈")		;;  	
        ("za432" "邛")		;;  	
        ("za433" "邢")		;;  	
        ("za434" "邳")		;;  	
        ("za435" "郅")		;;  	
        ("za436" "鄧")		;; 鄧	
        ("za437" "鄱")		;;  	
        ("za438" "鄴")		;;  	
        ("za439" "酈")		;;  	
        ("za43a" "酛")		;;  	
        ("za43b" "酤")		;;  	
        ("za43c" "酴")		;;  	
        ("za43d" "醃")		;;  	
        ("za43e" "醞")		;;  	
        ("za43f" "醮")		;;  	
        ("za440" "釃")		;;  	
        ("za441" "釗")		;; 釗	
        ("za442" "鈐")		;; 鈐	
        ("za443" "鈇")		;;  	
        ("za444" "鉏")		;;  	
        ("za445" "鉸")		;; 鉸	
        ("za446" "銈")		;; 銈	
        ("za447" "鍈")		;; 鍈	
        ("za448" "鏜")		;;  	
        ("za449" "鐲")		;;  	
        ("za44a" "鑊")		;;  	
        ("za44b" "鑣")		;;  	
        ("za44c" "閒")		;; 閒	
        ("za44d" "閟")		;;  	
        ("za44e" "閩")		;;  	
        ("za44f" "閽")		;;  	
        ("za450" "闓")		;;  	
        ("za451" "闐")		;;  	
        ("za452" "闚")		;;  	
        ("za453" "闞")		;;  	
        ("za454" "阼")		;;  	
        ("za455" "陘")		;;  	
        ("za456" "隄")		;;  	
        ("za457" "雒")		;;  	
        ("za458" "雞")		;;  	
        ("za459" "雩")		;;  	
        ("za45a" "靛")		;;  	
        ("za45b" "靳")		;;  	
        ("za45c" "鞺")		;;  	
        ("za45d" "韞")		;;  	
        ("za45e" "韛")		;;  	
        ("za45f" "韡")		;;  	
        ("za460" "頫")		;;  	
        ("za461" "顒")		;;  	
        ("za462" "顓")		;;  	
        ("za463" "顗")		;; 顗	
        ("za464" "顥")		;; 顥	
        ("za465" "颺")		;;  	
        ("za466" "飥")		;;  	
        ("za467" "餖")		;;  	
        ("za468" "餼")		;;  	
        ("za469" "餻")		;;  	
        ("za46a" "饘")		;;  	
        ("za46b" "駔")		;;  	
        ("za46c" "駙")		;;  	
        ("za46d" "騃")		;;  	
        ("za46e" "騶")		;;  	
        ("za46f" "騸")		;;  	
        ("za470" "魞")		;;  	
        ("za471" "鮏")		;; 鮏	
        ("za472" "鯁")		;;  	
        ("za473" "鰶")		;;  	
        ("za474" "鴞")		;;  	
        ("za475" "鵷")		;;  	
        ("za476" "鵰")		;; 鵰	
        ("za477" "鷃")		;;  	
        ("za478" "麨")		;;  	
        ("za479" "麼")		;; 麼	
        ("za47a" "黧")		;;  	
        ("za47b" "鼂")		;;  	
        ("za47c" "鼯")		;;  	
        ("za47d" "齁")		;;  	
        ("za47e" "齗")		;;  	
        ("za521" "龔")		;;  	
        ("za522" "捥")		;;  	
        ("za523" "楤")		;;  	
        ("za524" "丰")		;;  	異体字 
        ("za525" nil)		;; 	(未使用)
        ("za526" "挊")		;;  	
        ("za527" "艜")		;;  	
        ("za528" "桒")		;; 桒	
        ("za529" nil)		;; 	草書
        ("za52a" nil)		;; 	草書
        ("za52b" "亍")		;;  	
        ("za52c" "亹")		;;  	
        ("za52d" "儞")		;;  	
        ("za52e" "偁")		;;  	
        ("za52f" "儃")		;;  	
        ("za530" "佪")		;;  	
        ("za531" "儋")		;;  	
        ("za532" "儈")		;;  	
        ("za533" "侒")		;; 侒	
        ("za534" "佷")		;;  	
        ("za535" "伋")		;;  	
        ("za536" "傜")		;;  	
        ("za537" "淸")		;; 淸	
        ("za538" "卺")		;;  	
        ("za539" "划")		;;  	
        ("za53a" "勑")		;;  	
        ("za53b" "匇")		;; 匇	
        ("za53c" "匃")		;;  	
        ("za53d" "匜")		;;  	
        ("za53e" nil)		;; 	「世」の異体字 
        ("za53f" "嗢")		;;  	
        ("za540" "囉")		;;  	
        ("za541" "唽")		;;  	
        ("za542" "嚕")		;;  	
        ("za543" "噱")		;;  	
        ("za544" "嘽")		;;  	
        ("za545" "嚞")		;;  	
        ("za546" "喁")		;;  	
        ("za547" "噞")		;;  	
        ("za549" "哯")		;;  	
        ("za54a" "嚩")		;;  	
        ("za54b" "喈")		;;  	
        ("za54d" "晷")		;;  	
        ("za54e" "叵")		;;  	
        ("za54f" "嗩")		;;  	
        ("za550" "妋")		;;  	
        ("za551" "娭")		;;  	
        ("za552" "嫚")		;;  	
        ("za553" "嬗")		;;  	
        ("za555" "娓")		;;  	
        ("za556" "姞")		;;  	
        ("za558" "孁")		;;  	
        ("za559" "堄")		;;  	
        ("za55a" "埿")		;;  	
        ("za55c" "坍")		;;  	
        ("za55d" "垸")		;;  	
        ("za55e" "坅")		;;  	
        ("za55f" "坷")		;;  	
        ("za560" "壎")		;;  	
        ("za561" "塤")		;;  	
        ("za562" "堠")		;;  	
        ("za563" "墪")		;;  	
        ("za564" "埏")		;;  	
        ("za565" "媳")		;;  	
        ("za566" "墉")		;;  	
        ("za567" "坨")		;;  	
        ("za568" "圩")		;;  	
        ("za569" "尰")		;;  	
        ("za56a" "屟")		;;  	
        ("za56b" "屣")		;;  	
        ("za56d" "异")		;;  	異体字  已/廾
        ("za56f" "岺")		;; 岺	
        ("za570" "岏")		;;  	
        ("za571" "巋")		;;  	
        ("za572" "巑")		;;  	
        ("za573" "帔")		;;  	
        ("za574" "幉")		;;  	
        ("za575" "帒")		;;  	
        ("za576" "幞")		;;  	
        ("za578" "彇")		;;  	
        ("za579" "弣")		;;  	
        ("za57a" "弶")		;;  	
        ("za57b" "弽")		;;  	
        ("za57c" "庪")		;;  	
        ("za57d" "擌")		;;  	
        ("za621" "擎")		;; 擎	
        ("za622" "挗")		;;  	
        ("za623" "擐")		;;  	
        ("za624" "挍")		;;  	
        ("za625" "搯")		;;  	
        ("za626" "擷")		;;  	
        ("za627" "掙")		;;  	
        ("za628" "抳")		;;  	
        ("za629" "攞")		;;  	
        ("za62a" "挃")		;;  	
        ("za62b" "撾")		;;  	
        ("za62c" "摭")		;;  	
        ("za62d" "熮")		;;  	
        ("za62f" "烑")		;;  	
        ("za630" "灵")		;;  	
        ("za631" "煑")		;;  	
        ("za632" "爕")		;;  	
        ("za633" "焄")		;; 焄	
        ("za634" "獦")		;;  	
        ("za635" "猧")		;;  	
        ("za636" "猽")		;;  	
        ("za637" "獒")		;;  	
        ("za638" "獯")		;;  	
        ("za639" "獫")		;;  	
        ("za63a" "玁")		;;  	
        ("za63b" "狁")		;;  	
        ("za63c" "狻")		;;  	
        ("za63d" "瀼")		;;  	
        ("za63e" "瀣")		;;  	
        ("za63f" "洿")		;;  	
        ("za640" "濊")		;;  	
        ("za641" "澠")		;;  	
        ("za642" "潢")		;;  	
        ("za643" "灊")		;;  	
        ("za644" "淛")		;;  	
        ("za645" "涘")		;;  	
        ("za646" "湌")		;;  	
        ("za647" "灔")		;;  	
        ("za649" "涔")		;;  	
        ("za64a" "涬")		;; 涬	
        ("za64b" "邾")		;;  	
        ("za64c" "鄘")		;;  	
        ("za64d" "邶")		;;  	
        ("za64e" "鄀")		;;  	
        ("za64f" "鄽")		;;  	
        ("za650" "菇")		;; 菇	
        ("za651" "菆")		;;  	
        ("za652" "蓀")		;;  	
        ("za653" "藊")		;;  	
        ("za654" "蘅")		;;  	
        ("za655" "芺")		;;  	
        ("za656" "蒺")		;;  	
        ("za657" "蔾")		;;  	
        ("za658" "蘼")		;;  	
        ("za659" "薁")		;;  	
        ("za65a" "葒")		;;  	
        ("za65b" "蓯")		;;  	
        ("za65c" "蒾")		;;  	
        ("za65d" "蘩")		;;  	
        ("za65e" "蔌")		;;  	
        ("za65f" "蔞")		;;  	
        ("za660" "菝")		;;  	
        ("za661" "蕽")		;;  	
        ("za662" "蘡")		;;  	
        ("za663" "茛")		;;  	
        ("za664" "荽")		;;  	
        ("za665" "孽")		;;  	
        ("za666" "葜")		;;  	
        ("za667" "菀")		;;  	
        ("za668" "薟")		;;  	
        ("za669" "芾")		;;  	
        ("za66a" "蘘")		;;  	
        ("za66b" "蔲")		;;  	
        ("za66c" "蔯")		;;  	
        ("za66d" "荗")		;;  	
        ("za66e" "莔")		;;  	
        ("za66f" "噶")		;;  	
        ("za670" "藋")		;;  	
        ("za671" "莧")		;;  	
        ("za672" "苆")		;;  	
        ("za673" "蓪")		;;  	
        ("za674" "萁")		;;  	
        ("za675" "藦")		;;  	
        ("za676" "薷")		;;  	
        ("za677" "蘞")		;;  	
        ("za678" "莕")		;;  	
        ("za679" "蒅")		;;  	
        ("za67b" "芿")		;;  	
        ("za67c" "悆")		;;  	
        ("za67d" "忞")		;; 忞	
        ("za67e" "惸")		;;  	
        ("za721" "惝")		;;  	
        ("za722" "怳")		;;  	
        ("za723" "惔")		;;  	
        ("za724" "怍")		;;  	
        ("za725" "惋")		;;  	
        ("za726" "扆")		;;  	
        ("za727" "曛")		;;  	
        ("za728" "昀")		;; 昀	
        ("za729" "昪")		;;  	
        ("za72a" "暍")		;;  	
        ("za72b" "臗")		;;  	
        ("za72c" "臛")		;;  	
        ("za72d" "膘")		;;  	
        ("za72e" "榺")		;;  	
        ("za72f" "樾")		;;  	
        ("za730" "櫆")		;;  	
        ("za731" "柀")		;; 柀	
        ("za732" "棱")		;;  	
        ("za733" "橒")		;;  	
        ("za734" "檞")		;;  	
        ("za735" "檨")		;;  	
        ("za736" "杮")		;;  	
        ("za737" "楉")		;;  	
        ("za738" "樻")		;;  	
        ("za73a" "桕")		;;  	
        ("za73b" "棼")		;;  	
        ("za73c" "槾")		;;  	
        ("za73d" "楗")		;;  	
        ("za73e" "棙")		;;  	
        ("za740" "桄")		;; 桄	
        ("za741" "杴")		;;  	
        ("za742" "枒")		;;  	
        ("za743" "檫")		;;  	
        ("za744" "杈")		;;  	
        ("za745" "欋")		;;  	
        ("za746" "棅")		;;  	
        ("za747" "榀")		;;  	
        ("za748" "棻")		;;  	
        ("za749" "栭")		;;  	
        ("za74a" "榭")		;;  	
        ("za74b" "棌")		;;  	
        ("za74c" "欵")		;;  	
        ("za74d" "殩")		;;  	
        ("za74e" "殮")		;;  	
        ("za74f" "槩")		;;  	
        ("za750" "櫲")		;;  	
        ("za753" "穀")		;; 穀	
        ("za754" "蒁")		;;  	
        ("za755" "迱")		;;  	
        ("za757" "适")		;;  	
        ("za758" "逈")		;;  	
        ("za759" "迍")		;;  	
        ("za75a" "逭")		;;  	
        ("za75b" "迮")		;;  	
        ("za75c" "璈")		;;  	
        ("za75d" "瑄")		;;  	
        ("za75e" "璱")		;;  	
        ("za75f" "玦")		;;  	
        ("za760" "琯")		;;  	
        ("za761" "璙")		;;  	
        ("za762" "珅")		;;  	
        ("za763" "珣")		;; 珣	
        ("za764" "玠")		;;  	
        ("za765" "瓈")		;;  	
        ("za766" "璫")		;;  	
        ("za767" "琫")		;;  	
        ("za768" "瑍")		;;  	
        ("za769" "琊")		;;  	
        ("za76a" "疿")		;;  	
        ("za76b" "癕")		;;  	
        ("za76c" "皥")		;;  	
        ("za76d" "皪")		;;  	
        ("za76e" "盦")		;;  	
        ("za76f" "盔")		;;  	
        ("za770" "瞔")		;;  	
        ("za771" "睠")		;;  	
        ("za773" "瞟")		;;  	
        ("za774" "瞍")		;;  	
        ("za775" "眶")		;;  	
        ("za777" "畾")		;;  	
        ("za778" "矪")		;;  	
        ("za779" "矬")		;;  	
        ("za77a" "穭")		;;  	
        ("za77c" "袽")		;;  	
        ("za77d" "襅")		;;  	
        ("za77e" "筯")		;;  	
        ("za821" "帘")		;;  	
        ("za822" "笇")		;;  	
        ("za823" "篗")		;;  	
        ("za824" "籡")		;;  	
        ("za825" "籗")		;;  	
        ("za826" "褲")		;;  	
        ("za827" "褙")		;;  	
        ("za828" "粿")		;;  	
        ("za82b" "縬")		;;  	
        ("za82c" "罇")		;; 罇	
        ("za82d" "纆")		;;  	
        ("za82e" "耖")		;;  	
        ("za82f" "耟")		;;  	
        ("za830" "艉")		;;  	
        ("za831" "賾")		;;  	
        ("za832" "蟫")		;;  	
        ("za833" "蜺")		;;  	
        ("za834" "蚨")		;;  	
        ("za835" "蟭")		;;  	
        ("za836" "蠐")		;;  	
        ("za837" "螬")		;;  	
        ("za838" "蜟")		;;  	
        ("za839" "蠼")		;;  	
        ("za83a" "螋")		;;  	
        ("za83b" "蚍")		;;  	
        ("za83c" "蟟")		;;  	
        ("za83d" "蛁")		;;  	
        ("za83e" "蜞")		;;  	
        ("za841" "蝯")		;;  	
        ("za843" "鵒")		;;  	
        ("za844" "鴝")		;;  	
        ("za845" "鸜")		;;  	
        ("za846" "鸇")		;;  	
        ("za847" "鶖")		;;  	
        ("za849" "鸍")		;;  	
        ("za84a" "鵩")		;;  	
        ("za84b" "鶡")		;;  	
        ("za84c" "鷴")		;;  	
        ("za84e" "鷧")		;;  	
        ("za84f" "鏌")		;;  	
        ("za850" "鎁")		;;  	
        ("za851" "鍱")		;;  	
        ("za852" "銙")		;;  	
        ("za853" "釭")		;; 釭	
        ("za854" "鉧")		;; 鉧	
        ("za855" "鍑")		;;  	
        ("za856" "鏽")		;;  	
        ("za857" "錕")		;;  	
        ("za858" "鋂")		;;  	
        ("za859" "鋧")		;; 鋧	
        ("za85a" "鐴")		;;  	
        ("za85c" "鋐")		;; 鋐	
        ("za85d" "蹔")		;;  	
        ("za85f" "踶")		;;  	
        ("za860" "詵")		;;  	
        ("za861" "諐")		;;  	
        ("za862" "誮")		;;  	
        ("za863" "謭")		;;  	
        ("za864" "誷")		;;  	
        ("za865" "觶")		;;  	
        ("za866" "釄")		;;  	
        ("za867" "醼")		;;  	
        ("za868" "醨")		;;  	
        ("za869" "釱")		;;  	
        ("za86a" "釻")		;;  	
        ("za86b" "鎛")		;;  	
        ("za86c" "鐧")		;;  	
        ("za86e" "鉃")		;;  	
        ("za86f" "纇")		;;  	
        ("za870" "熲")		;;  	
        ("za871" "頞")		;;  	
        ("za872" "顖")		;;  	
        ("za873" "蒴")		;; 蒴	
        ("za874" "蕺")		;;  	
        ("za875" "芩")		;;  	
        ("za876" "佺")		;;  	
        ("za877" "佾")		;;  	
        ("za878" "俏")		;;  	
        ("za879" "倻")		;;  	
        ("za87a" "儵")		;;  	
        ("za87b" "噦")		;;  	
        ("za87c" "嗉")		;;  	
        ("za87d" "嘰")		;;  	
        ("za87e" "吒")		;;  	
        ("za921" "唵")		;;  	
        ("za922" "唼")		;;  	
        ("za923" "埦")		;;  	
        ("za924" "墝")		;;  	
        ("za925" "埵")		;;  	
        ("za926" "垜")		;;  	
        ("za927" "墩")		;;  	
        ("za928" "圳")		;;  	
        ("za929" "壒")		;;  	
        ("za92a" "羗")		;;  	
        ("za92b" "搢")		;;  	
        ("za92c" "搩")		;;  	
        ("za92d" "攩")		;;  	
        ("za92e" "擤")		;;  	
        ("za92f" "挵")		;;  	
        ("za930" "拼")		;;  	
        ("za931" "擻")		;;  	
        ("za932" "掽")		;;  	
        ("za933" "湑")		;;  	
        ("za934" "濹")		;;  	
        ("za935" "泔")		;;  	
        ("za936" "犎")		;;  	
        ("za937" "桛")		;;  	
        ("za938" "梣")		;;  	
        ("za939" "樏")		;;  	
        ("za93a" "梻")		;;  	
        ("za93b" "橐")		;;  	
        ("za93c" "梘")		;;  	
        ("za93d" "梲")		;;  	
        ("za93e" "橅")		;;  	
        ("za93f" "檉")		;;  	
        ("za941" "櫧")		;;  	
        ("za942" "枻")		;; 枻	
        ("za943" "柃")		;;  	
        ("za944" "栱")		;;  	
        ("za945" "栬")		;;  	
        ("za946" "樝")		;;  	
        ("za947" "橖")		;;  	
        ("za948" "朳")		;;  	
        ("za949" "棭")		;;  	
        ("za94a" "梂")		;;  	
        ("za94c" "榰")		;;  	
        ("za94d" "柷")		;;  	
        ("za94e" "槵")		;;  	
        ("za94f" "檔")		;;  	
        ("za950" "桫")		;;  	
        ("za951" "欏")		;;  	
        ("za952" "枓")		;;  	
        ("za953" "楲")		;;  	
        ("za954" "腭")		;;  	
        ("za955" "胳")		;;  	
        ("za956" "腨")		;;  	
        ("za957" "朓")		;;  	
        ("za958" "鰧")		;;  	
        ("za959" "蓏")		;;  	
        ("za95a" "玫")		;;  	
        ("za95b" "琰")		;;  	
        ("za95c" "瑇")		;;  	
        ("za95d" "璩")		;;  	
        ("za95e" "珧")		;;  	
        ("za95f" "瑀")		;;  	
        ("za960" "瑒")		;;  	
        ("za961" "瑭")		;;  	
        ("za962" "玔")		;;  	
        ("za963" "珖")		;; 珖	
        ("za964" "玢")		;;  	
        ("za965" "皶")		;;  	
        ("za966" "麬")		;;  	
        ("za967" "硨")		;;  	
        ("za968" "磠")		;;  	
        ("za969" "磤")		;;  	
        ("za96a" "磲")		;;  	
        ("za96b" "砍")		;;  	
        ("za96c" "硾")		;;  	
        ("za96d" "碰")		;;  	
        ("za96e" "硇")		;;  	
        ("za96f" "礀")		;;  	
        ("za970" "畺")		;;  	
        ("za971" "裰")		;;  	
        ("za972" "裑")		;;  	
        ("za973" "袘")		;;  	
        ("za974" "襀")		;;  	
        ("za975" "裓")		;;  	
        ("za977" "褘")		;;  	
        ("za978" "褹")		;;  	
        ("za979" "襢")		;;  	
        ("za97a" "褨")		;;  	
        ("za97b" "篊")		;;  	
        ("za97c" "笧")		;;  	
        ("za97d" "簁")		;;  	
        ("za97e" "簎")		;;  	
        ("zaa21" "簶")		;;  	
        ("zaa22" "籰")		;;  	
        ("zaa23" "籙")		;;  	
        ("zaa24" "籭")		;;  	
        ("zaa25" "箯")		;;  	
        ("zaa26" "籑")		;;  	
        ("zaa27" "荇")		;;  	
        ("zaa28" "蓎")		;;  	
        ("zaa29" "笯")		;;  	
        ("zaa2b" "篅")		;;  	
        ("zaa2c" "簳")		;;  	
        ("zaa2d" "簹")		;;  	
        ("zaa2e" "篔")		;;  	
        ("zaa31" "筲")		;;  	
        ("zaa32" "笭")		;;  	
        ("zaa33" "筎")		;;  	
        ("zaa34" "羖")		;;  	
        ("zaa35" "籹")		;;  	
        ("zaa36" "粏")		;;  	
        ("zaa37" "糈")		;;  	
        ("zaa38" "糫")		;;  	
        ("zaa39" "粼")		;;  	
        ("zaa3a" "粔")		;;  	
        ("zaa3b" "粶")		;;  	
        ("zaa3c" "糙")		;;  	
        ("zaa3d" "糄")		;;  	
        ("zaa3e" "粬")		;;  	
        ("zaa3f" "糵")		;;  	
        ("zaa40" "紽")		;;  	
        ("zaa41" "緌")		;;  	
        ("zaa42" "絁")		;;  	
        ("zaa43" "紇")		;;  	
        ("zaa44" "纑")		;;  	
        ("zaa45" "緦")		;;  	
        ("zaa46" "紞")		;;  	
        ("zaa47" "纍")		;;  	
        ("zaa49" "羿")		;;  	
        ("zaa4a" "翺")		;;  	
        ("zaa4b" "翥")		;;  	
        ("zaa4c" "羕")		;;  	
        ("zaa4d" "蝲")		;;  	
        ("zaa4e" "蟖")		;;  	
        ("zaa4f" "蚸")		;;  	
        ("zaa50" "蜓")		;;  	
        ("zaa51" "蜾")		;;  	
        ("zaa52" "螇")		;;  	
        ("zaa53" "蠁")		;;  	
        ("zaa54" "蜱")		;;  	
        ("zaa56" "蛺")		;;  	
        ("zaa57" "虵")		;;  	
        ("zaa58" "蝱")		;;  	
        ("zaa59" "蠔")		;;  	
        ("zaa5a" "蝤")		;;  	
        ("zaa5b" "蛑")		;;  	
        ("zaa5c" "蠊")		;;  	
        ("zaa5d" "蠆")		;;  	
        ("zaa5e" "螠")		;;  	
        ("zaa5f" "鈸")		;;  	
        ("zaa60" "錑")		;;  	
        ("zaa61" "鎺")		;;  	
        ("zaa62" "鍰")		;; 鍰	
        ("zaa63" "鏁")		;;  	
        ("zaa64" "銲")		;;  	
        ("zaa65" "鈹")		;; 鈹	
        ("zaa66" "鏟")		;;  	
        ("zaa67" "鐖")		;;  	
        ("zaa68" "鑯")		;;  	
        ("zaa69" "闋")		;;  	
        ("zaa6b" "鏱")		;;  	
        ("zaa6c" "鈼")		;; 鈼	
        ("zaa6e" "鬌")		;;  	
        ("zaa6f" "鞖")		;;  	
        ("zaa70" "靪")		;;  	
        ("zaa71" "鞚")		;;  	
        ("zaa72" "靮")		;;  	
        ("zaa73" "鬠")		;;  	
        ("zaa74" "鱘")		;;  	
        ("zaa75" "鮬")		;;  	
        ("zaa76" "鱰")		;;  	
        ("zaa77" "鱪")		;;  	
        ("zaa78" "鯳")		;;  	
        ("zaa79" "鱵")		;;  	
        ("zaa7a" "鯯")		;;  	
        ("zaa7b" "鯧")		;;  	
        ("zaa7c" "魳")		;;  	
        ("zaa7d" "鯎")		;;  	
        ("zaa7e" "鯥")		;;  	
        ("zab21" "鮄")		;;  	
        ("zab22" "鱩")		;;  	
        ("zab23" "鱮")		;;  	
        ("zab24" "鯇")		;;  	
        ("zab25" "鮞")		;;  	
        ("zab26" "鰖")		;;  	
        ("zab27" "鮸")		;;  	
        ("zab28" "鯷")		;;  	
        ("zab29" "魬")		;;  	
        ("zab2a" "鯘")		;;  	
        ("zab2b" "鱫")		;;  	
        ("zab2c" "鱝")		;;  	
        ("zab2d" "鱏")		;;  	
        ("zab2e" "鱓")		;;  	
        ("zab2f" "鰱")		;;  	
        ("zab30" "鮊")		;;  	
        ("zab31" "鱛")		;;  	
        ("zab32" "鮾")		;;  	
        ("zab33" "鱁")		;;  	
        ("zab34" "鮧")		;;  	
        ("zab35" "魦")		;;  	
        ("zab36" "鱭")		;;  	
        ("zab37" "孒")		;;  	
        ("zab38" "甪")		;;  	
        ("zab39" "厴")		;;  	
        ("zab3a" "尩")		;;  	
        ("zab3b" "车")		;;  	車の簡体字
        ("zab3c" "电")		;;  	電の簡体字
        ("zab3d" "邌")		;;  	
        ("zab3e" "仐")		;;  	
        ("zab3f" "么")		;;  	
        ("zab40" "蠃")		;;  	
        ("zab41" "兗")		;;  	
        ("zab42" "矠")		;;  	
        ("zab43" "矟")		;;  	
        ("zab44" "劻")		;;  	
        ("zab45" "勰")		;;  	
        ("zab46" "斲")		;;  	
        ("zab47" "姧")		;;  	
        ("zab48" "嬥")		;;  	
        ("zab49" "妤")		;; 妤	
        ("zab4a" "媞")		;;  	
        ("zab4c" "廋")		;;  	
        ("zab4d" "庿")		;;  	
        ("zab4e" "愒")		;;  	
        ("zab4f" "憍")		;;  	
        ("zab50" "愐")		;;  	
        ("zab51" "豇")		;;  	
        ("zab52" "豉")		;;  	
        ("zab53" "雘")		;;  	
        ("zab54" "彔")		;;  	
        ("zab55" "邕")		;;  	
        ("zab56" "隺")		;;  	
        ("zab57" "幫")		;;  	
        ("zab58" "帮")		;;  	
        ("zab59" "毈")		;;  	
        ("zab5b" "彽")		;;  	
        ("zab5c" "徸")		;;  	
        ("zab5d" "鄯")		;;  	
        ("zab5e" "郄")		;;  	
        ("zab5f" "邙")		;;  	
        ("zab60" "隩")		;;  	
        ("zab61" "犰")		;;  	
        ("zab62" "狳")		;;  	
        ("zab63" "獱")		;;  	
        ("zab64" "貛")		;;  	
        ("zab65" "攲")		;;  	
        ("zab66" "爗")		;;  	
        ("zab67" "滎")		;;  	
        ("zab68" "煠")		;;  	
        ("zab69" "燄")		;;  	
        ("zab6a" "炻")		;; 炻	
        ("zab6b" "烤")		;;  	
        ("zab6c" "炗")		;;  	
        ("zab6d" "剡")		;;  	
        ("zab6e" "昉")		;; 昉	
        ("zab6f" "昰")		;;  	
        ("zab70" "甗")		;;  	
        ("zab72" "瓫")		;;  	
        ("zab74" "敔")		;;  	
        ("zab75" "忩")		;;  	
        ("zab76" "毿")		;;  	
        ("zab77" "瘵")		;;  	
        ("zab78" "痎")		;;  	
        ("zab79" "癋")		;;  	
        ("zab7a" "疒")		;;  	
        ("zab7b" "癤")		;;  	
        ("zab7c" "癭")		;;  	
        ("zab7d" "瘙")		;;  	
        ("zab7e" "痟")		;;  	
        ("zac21" "痏")		;;  	
        ("zac22" "眴")		;;  	
        ("zac23" "睺")		;;  	
        ("zac24" "毗")		;;  	
        ("zac25" "翮")		;;  	
        ("zac27" "稭")		;;  	
        ("zac28" "稹")		;;  	
        ("zac29" "祆")		;;  	
        ("zac2a" "禖")		;;  	
        ("zac2b" "皁")		;;  	
        ("zac2c" "皝")		;;  	
        ("zac2d" "翃")		;;  	
        ("zac2e" "舢")		;;  	
        ("zac2f" "艠")		;;  	
        ("zac32" "趯")		;;  	
        ("zac33" "醶")		;;  	
        ("zac34" "跑")		;;  	
        ("zac35" "蹰")		;;  	
        ("zac36" "躃")		;;  	
        ("zac37" "跆")		;;  	
        ("zac38" "韉")		;;  	
        ("zac39" "饠")		;;  	
        ("zac3a" "躻")		;;  	
        ("zac3b" "髹")		;;  	
        ("zac3c" "髁")		;;  	
        ("zac3d" "餛")		;;  	
        ("zac3e" "餺")		;;  	
        ("zac3f" "飣")		;;  	
        ("zac40" "飰")		;;  	
        ("zac41" "饆")		;;  	
        ("zac42" "靏")		;; 靏	
        ("zac43" "閦")		;;  	
        ("zac44" "闈")		;;  	
        ("zac45" "顬")		;;  	
        ("zac46" "頊")		;;  	
        ("zac47" "骶")		;;  	
        ("zac48" "髐")		;;  	
        ("zac4a" "鶍")		;;  	
        ("zac4b" "鴲")		;;  	
        ("zac4c" "鸕")		;;  	
        ("zac4d" "鵼")		;;  	
        ("zac4e" "鷀")		;;  	
        ("zac50" "鼹")		;;  	
        ("zac51" "鼷")		;;  	
        ("zac52" "髖")		;;  	
        ("zac54" "鸊")		;;  	
        ("zac55" "鷉")		;;  	
        ("zac56" "鵟")		;;  	
        ("zac57" "鷟")		;;  	
        ("zac58" "鵂")		;;  	
        ("zac59" "鶹")		;;  	
        ("zac5a" "鴗")		;;  	
        ("zac5b" "鷚")		;;  	
        ("zac5c" "鵇")		;;  	
        ("zac5d" "鶊")		;;  	
        ("zac5e" "鶼")		;;  	
        ("zac5f" "觫")		;;  	
        ("zac60" "觘")		;;  	
        ("zac61" "觿")		;;  	
        ("zac62" "剕")		;;  	
        ("zac63" "颸")		;;  	
        ("zac64" "飇")		;;  	
        ("zac65" "飈")		;;  	
        ("zac66" "贉")		;;  	
        ("zac67" "賖")		;;  	
        ("zac68" "赬")		;;  	
        ("zac69" "鼗")		;;  	
        ("zac6a" "鼐")		;;  	
        ("zac6b" "鼺")		;;  	
        ("zac6c" "齝")		;;  	
        ("zac6d" "齭")		;;  	
        ("zac6e" "齵")		;;  	
        ("zac6f" "龗")		;;  	
        ("zac70" "蓂")		;;  	
        ("zac71" "藎")		;;  	
        ("zac72" "葼")		;;  	
        ("zac73" "茼")		;;  	
        ("zac74" "藭")		;;  	
        ("zac75" "薼")		;;  	
        ("zac76" "菪")		;;  	
        ("zac77" "莩")		;;  	
        ("zac78" "蓽")		;;  	
        ("zac79" "苕")		;;  	
        ("zac7a" "芡")		;;  	
        ("zac7b" "茺")		;;  	
        ("zac7d" "蔤")		;;  	
        ("zad21" "葈")		;; 葈	
        ("zad22" "你")		;;  	
        ("zad23" "儛")		;;  	
        ("zad25" "塼")		;;  	
        ("zad26" "坼")		;;  	
        ("zad27" "塌")		;;  	
        ("zad28" "垿")		;;  	
        ("zad29" "姮")		;;  	
        ("zad2a" "媧")		;;  	
        ("zad2b" "嬙")		;;  	
        ("zad2c" "渲")		;;  	
        ("zad2d" "洦")		;;  	
        ("zad2e" "滇")		;;  	
        ("zad2f" "潙")		;;  	
        ("zad30" "澶")		;;  	
        ("zad31" "涮")		;;  	
        ("zad32" "涪")		;;  	
        ("zad33" "啐")		;;  	
        ("zad34" "嚈")		;;  	
        ("zad35" "噠")		;;  	
        ("zad36" "弴")		;; 弴	
        ("zad37" "哆")		;;  	
        ("zad38" "嚳")		;;  	
        ("zad39" "洱")		;;  	
        ("zad3a" "灃")		;;  	
        ("zad3b" "濞")		;;  	
        ("zad3c" "湉")		;;  	
        ("zad3d" "泆")		;;  	
        ("zad3e" "洹")		;;  	
        ("zad3f" "昫")		;;  	
        ("zad40" "暠")		;; 暠	
        ("zad41" "昕")		;; 昕	
        ("zad42" "昺")		;;  	
        ("zad43" "桲")		;;  	
        ("zad44" "橉")		;;  	
        ("zad45" "窼")		;;  	
        ("zad46" "穇")		;;  	
        ("zad47" "秫")		;;  	
        ("zad48" "秭")		;;  	
        ("zad49" "禛")		;; 禛	
        ("zad4a" "祜")		;;  	
        ("zad4b" "祹")		;;  	
        ("zad4c" "蜇")		;;  	
        ("zad4d" "蛼")		;;  	
        ("zad4e" "蚜")		;;  	
        ("zad4f" "蚉")		;;  	
        ("zad50" "蛽")		;;  	
        ("zad52" "螵")		;;  	
        ("zad53" "蚇")		;;  	
        ("zad54" "螓")		;;  	
        ("zad55" "蜐")		;;  	
        ("zad56" "瘀")		;;  	
        ("zad58" "瘼")		;;  	
        ("zad5a" "痱")		;;  	
        ("zad5b" "癯")		;;  	
        ("zad5c" "癁")		;;  	
        ("zad5d" "礴")		;;  	
        ("zad5e" "礜")		;;  	
        ("zad5f" "砉")		;;  	
        ("zad60" "耷")		;;  	
        ("zad61" "耼")		;;  	
        ("zad63" "軑")		;;  	
        ("zad64" "轘")		;;  	
        ("zad65" "輀")		;;  	
        ("zad66" "魹")		;;  	
        ("zad67" "韴")		;;  	
        ("zad68" "鞲")		;;  	
        ("zad6b" "鮲")		;;  	
        ("zad6d" "鰘")		;;  	
        ("zad6f" "鰙")		;;  	
        ("zad70" "鯝")		;;  	
        ("zad71" "鰣")		;;  	
        ("zad72" "鯽")		;;  	
        ("zad74" "魶")		;;  	
        ("zad75" "鰚")		;;  	
        ("zad76" "鱲")		;;  	
        ("zad77" "鱜")		;;  	
        ("zad79" "鱊")		;;  	
        ("zad7a" "鱐")		;;  	
        ("zad7b" "鱟")		;;  	
        ("zad7c" "魣")		;;  	
        ("zad7d" "魫")		;;  	
        ("zad7e" "驎")		;; 驎	
        ("zae21" "麯")		;;  	
        ("zae22" "驌")		;;  	
        ("zae23" "騮")		;;  	
        ("zae24" "驊")		;;  	異体字 
        ("zae25" "駃")		;;  	
        ("zae26" "騠")		;;  	
        ("zae27" "駰")		;;  	
        ("zae28" "騭")		;;  	
        ("zae29" "麅")		;;  	
        ("zae2a" "麞")		;;  	
        ("zae2c" nil)		;; 	にんべん
        ("zae2d" "乚")		;;  	
        ("zae2e" nil)		;; 	u2E8B( )
        ("zae2f" "氵")		;;  	
        ("zae30" "艹")		;;  	
        ("zae31" "艹")		;;  	
        ("zae32" "扌")		;;  	
        ("zae33" "阝")		;;  	
        ("zae34" "犭")		;;  	
        ("zae35" "阝")		;;  	
        ("zae36" "刂")		;;  	
        ("zae37" nil)		;; 	やね
        ("zae38" "忄")		;;  	
        ("zae39" nil)		;; 	u2EB3( )
        ("zae3a" "耂")		;;  	
        ("zae3b" "爫")		;;  	
        ("zae3c" nil)		;; 	のつ
        ("zae3d" "灬")		;;  	
        ("zae3e" nil)		;; 	u38FA( )
        ("zae3f" "氺")		;;  	
        ("zae40" nil)		;; 	王偏 &M020824;
        ("zae41" "罒")		;;  	
        ("zae42" "礻")		;;  	
        ("zae43" "衤")		;;  	
        ("zae44" "飠")		;;  	食
        ("zae45" nil)		;; 	食
        ("zae46" nil)		;; 	「末」の初二画
        ("zae47" nil)		;; 	すてふで
        ("zae48" nil)		;; 	合字（トキ）
        ("zae49" nil)		;; 	合字（こと）
        ("zae4a" nil)		;; 	かりがねてん 
        ("zae4b" nil)		;; 	「玄」の欠画
        ("zae4c" nil)		;; 	「統」の欠画
        ("zae4d" nil)		;; 	たまへんの偏
        ("zae4e" nil)		;; 	 の部分
        ("zae4f" nil)		;; 	一字金輪仏頂尊
        ("zae51" nil)		;; 	異体文字「こ」
        ("zae52" nil)		;; 	異体文字「は」
        ("zae53" nil)		;; 	変体仮名「い」
        ("zae54" nil)		;; 	変体仮名「た」
        ("zae55" nil)		;; 	変体仮名「か」
        ("zae56" nil "*")	;; 	
        ("zae57" nil "**")	;; 	
        ("zae58" "©")		;; c	
        ("zae59" "♮")		;;  	
        ("zae5a" nil)		;; 	《楽》延長記号
        ("zae5b" nil)		;; 	《楽》延長記号
        ("zae5c" nil)		;; 	16分音符
        ("zae5d" nil "***")	;; 	
        ("zae5e" nil "*")	;; 	上付*
        ("zae5f" "㊙" "(秘)")	;;  	
        ("zae60" "☞")		;;  	
        ("zae61" nil)		;; 	《楽》スラー
        ("zae62" nil)		;; 	《楽》スラー
        ("zae63" nil)		;; 	フランス王家のイチハツ紋
        ("zae64" nil)		;; 	ハーケンクロイツ(45度傾く)
        ("zae65" nil)		;; 	右まんじ(卍の逆)
        ("zae66" nil)		;;  	tick 照合〔チェック〕の印
        ("zae67" nil)		;; 	古英語のp(近代のth)
        ("zae68" nil "c/o")	;; 	care of
        ("zae69" "®" "(R)")	;; R	
        ("zae6a" nil "3√a")	;; 	
        ("zae6b" "Æ" "AE")	;; A	
        ("zae6c" "æ" "ae")	;; a	
        ("zae6d" nil "ffi")	;; 	uFB03
        ("zae6e" "ﬂ" "fl")	;;  	
        ("zae6f" nil "n√")	;; 	
        ("zae70" "œ" "oe")	;;  	
        ("zae71" "∘" "○")	;;  	
        ("zae72" nil "+-")	;; 	+と-を合わせた記号
        ("zae73" nil)		;; 	やまがた
        ("zae74" "℧")		;;  	
        ("zae75" nil "√2")	;; 	
        ("zae76" nil "√a")	;; 	
        ("zae77" "©")		;; c	
        ("zae78" nil "(公)")	;; 	
        ("zae79" "㊜" "(適)")	;;  	丸適マーク
        ("zae7a" "〖" "【")	;;  	
        ("zae7b" "〗" "】")	;;  	
        ("zae7c" nil)		;; 	(未使用)
        ("zae7d" nil)		;; 	(未使用)
        ("zae7e" nil)		;; 	(未使用)
        ("zaf21" nil)		;; 	(未使用)
        ("zaf22" nil)		;; 	(未使用)
        ("zaf23" nil)		;; 	(未使用)
        ("zaf24" nil)		;; 	(未使用)
        ("zaf25" nil)		;; 	(未使用)
        ("zaf26" nil)		;; 	(未使用)
        ("zaf27" nil)		;; 	(未使用)
        ("zaf28" nil)		;; 	(未使用)
        ("zaf29" nil)		;; 	(未使用)
        ("zaf2a" nil)		;; 	(未使用)
        ("zaf2b" nil)		;; 	(未使用)
        ("zaf2c" nil)		;; 	(未使用)
        ("zaf2d" nil)		;; 	(未使用)
        ("zaf2e" nil)		;; 	(未使用)
        ("zaf2f" nil)		;; 	(未使用)
        ("zaf30" nil)		;; 	(未使用)
        ("zaf31" nil)		;; 	(未使用)
        ("zaf32" nil)		;; 	(未使用)
        ("zaf33" nil)		;; 	(未使用)
        ("zaf34" nil)		;; 	(未使用)
        ("zaf35" nil)		;; 	(未使用)
        ("zaf36" nil)		;; 	(未使用)
        ("zaf37" nil)		;; 	(未使用)
        ("zaf38" nil)		;; 	(未使用)
        ("zaf39" nil)		;; 	(未使用)
        ("zaf3a" nil)		;; 	(未使用)
        ("zaf3b" nil)		;; 	(未使用)
        ("zaf3c" nil)		;; 	(未使用)
        ("zaf3d" nil)		;; 	(未使用)
        ("zaf3e" nil)		;; 	(未使用)
        ("zaf3f" nil)		;; 	(未使用)
        ("zaf40" nil)		;; 	(未使用)
        ("zaf41" nil)		;; 	(未使用)
        ("zaf42" nil)		;; 	(未使用)
        ("zaf43" nil)		;; 	(未使用)
        ("zaf44" nil)		;; 	(未使用)
        ("zaf45" nil)		;; 	(未使用)
        ("zaf46" nil)		;; 	(未使用)
        ("zaf47" nil)		;; 	(未使用)
        ("zaf48" nil)		;; 	(未使用)
        ("zaf49" nil)		;; 	(未使用)
        ("zaf4a" nil)		;; 	(未使用)
        ("zaf4b" nil)		;; 	(未使用)
        ("zaf4c" nil)		;; 	(未使用)
        ("zaf4d" nil)		;; 	(未使用)
        ("zaf4e" nil)		;; 	(未使用)
        ("zaf4f" nil)		;; 	(未使用)
        ("zaf50" nil)		;; 	(未使用)
        ("zaf51" nil)		;; 	(未使用)
        ("zaf52" nil)		;; 	(未使用)
        ("zaf53" nil)		;; 	(未使用)
        ("zaf54" nil)		;; 	(未使用)
        ("zaf55" nil)		;; 	(未使用)
        ("zaf56" nil)		;; 	(未使用)
        ("zaf57" nil)		;; 	(未使用)
        ("zaf58" nil)		;; 	(未使用)
        ("zaf59" nil)		;; 	(未使用)
        ("zaf5a" nil)		;; 	(未使用)
        ("zaf5b" nil)		;; 	(未使用)
        ("zaf5c" nil)		;; 	(未使用)
        ("zaf5d" nil)		;; 	(未使用)
        ("zaf5e" nil)		;; 	(未使用)
        ("zaf5f" nil)		;; 	(未使用)
        ("zaf60" nil)		;; 	(未使用)
        ("zaf61" nil)		;; 	(未使用)
        ("zaf62" nil)		;; 	(未使用)
        ("zaf63" nil)		;; 	(未使用)
        ("zaf64" nil)		;; 	(未使用)
        ("zaf65" nil)		;; 	(未使用)
        ("zaf66" nil)		;; 	(未使用)
        ("zaf67" nil)		;; 	(未使用)
        ("zaf68" nil)		;; 	(未使用)
        ("zaf69" nil)		;; 	(未使用)
        ("zaf6a" nil)		;; 	(未使用)
        ("zaf6b" nil)		;; 	(未使用)
        ("zaf6c" nil)		;; 	(未使用)
        ("zaf6d" nil)		;; 	(未使用)
        ("zaf6e" nil)		;; 	(未使用)
        ("zaf6f" nil)		;; 	(未使用)
        ("zaf70" nil)		;; 	(未使用)
        ("zaf71" nil)		;; 	(未使用)
        ("zaf72" nil)		;; 	(未使用)
        ("zaf73" nil)		;; 	(未使用)
        ("zaf74" nil)		;; 	(未使用)
        ("zaf75" nil)		;; 	(未使用)
        ("zaf76" nil)		;; 	(未使用)
        ("zaf77" nil)		;; 	(未使用)
        ("zaf78" nil)		;; 	(未使用)
        ("zaf79" nil)		;; 	(未使用)
        ("zaf7a" nil)		;; 	(未使用)
        ("zaf7b" nil)		;; 	(未使用)
        ("zaf7c" nil)		;; 	(未使用)
        ("zaf7d" nil)		;; 	(未使用)
        ("zaf7e" nil)		;; 	(未使用)
        ("zb021" nil)		;; 	(未使用)
        ("zb022" nil)		;; 	(未使用)
        ("zb023" nil)		;; 	(未使用)
        ("zb024" nil)		;; 	(未使用)
        ("zb025" nil)		;; 	(未使用)
        ("zb026" nil)		;; 	(未使用)
        ("zb027" nil)		;; 	(未使用)
        ("zb028" nil)		;; 	(未使用)
        ("zb029" nil)		;; 	(未使用)
        ("zb02a" nil)		;; 	(未使用)
        ("zb02b" nil)		;; 	(未使用)
        ("zb02c" nil)		;; 	(未使用)
        ("zb02d" nil)		;; 	(未使用)
        ("zb02e" nil)		;; 	(未使用)
        ("zb02f" nil)		;; 	(未使用)
        ("zb030" nil)		;; 	(未使用)
        ("zb031" nil)		;; 	(未使用)
        ("zb032" nil)		;; 	卦を表す横段。（陰）
        ("zb033" nil)		;; 	卦を表す横段。（陽）
        ("zb034" "☰")		;;  	
        ("zb035" "☷")		;;  	
        ("zb036" "☱")		;;  	
        ("zb037" "☲")		;;  	
        ("zb038" "☴")		;;  	
        ("zb039" "☵")		;;  	
        ("zb03a" "☶")		;;  	
        ("zb03b" nil)		;;  	u3033
        ("zb03c" nil)		;;  	u3034
        ("zb03d" nil)		;;  	u3035
        ("zb03e" nil)		;;  	u303B 二の字点
        ("zb03f" nil)		;; 	複十字
        ("zb040" "℉")		;;  	
        ("zb041" "〽")		;;  	いおりてん
        ("zb042" "卍")		;; 卍	
        ("zb043" "♨")		;;  	温泉マーク
        ("zb044" "♠")		;;  	
        ("zb045" "♥")		;;  	
        ("zb046" nil)		;; 	フェルマータ
        ("zb047" nil)		;; 	オンス
        ("zb048" nil)		;; 	ホの異体文字
        ("zb049" nil)		;; 	いおりてん 
        ("zb04a" "♩")		;;  	
        ("zb04b" nil)		;; 	ダルセーニョ 
        ("zb04c" nil)		;; 	重嬰記号
        ("zb04d" "❶" "(1)")	;;  	
        ("zb04e" "❷" "(2)")	;;  	
        ("zb04f" "❸" "(3)")	;;  	
        ("zb050" "❹" "(4)")	;;  	
        ("zb051" "❺" "(5)")	;;  	
        ("zb052" "❻" "(6)")	;;  	
        ("zb053" "❼" "(7)")	;;  	
        ("zb054" "❽" "(8)")	;;  	
        ("zb055" "❾" "(9)")	;;  	
        ("zb056" "❿" "(10)")	;;  	
        ("zb057" "⓫" "(11)")	;;  	
        ("zb058" "⓬" "(12)")	;;  	
        ("zb059" "⓭" "(13)")	;;  	
        ("zb05a" "⓮" "(14)")	;;  	
        ("zb05b" "⓯" "(15)")	;;  	
        ("zb05c" "⓰" "(16)")	;;  	
        ("zb05d" "⓱" "(17)")	;;  	
        ("zb05e" "⓲" "(18)")	;;  	
        ("zb05f" "⓳" "(19)")	;;  	
        ("zb060" nil)		;; 	小さい「ゑ」
        ("zb061" nil "ガ")	;; 	小さい文字
        ("zb062" nil)		;; 	(未使用)
        ("zb063" nil)		;; 	(未使用)
        ("zb064" nil)		;; 	(未使用)
        ("zb065" nil "ト")	;; 	小さい文字
        ("zb066" "ノ" "ノ")	;; ノ	小さい文字
        ("zb067" nil)		;; 	(未使用)
        ("zb068" nil "ミ")	;; 	
        ("zb069" nil)		;; 	(未使用)
        ("zb06a" nil "ロ")	;; 	
        ("zb06b" "ヰ")		;; ヰ	
        ("zb06c" nil "ン")	;; 	
        ("zb06d" nil)		;; 	(未使用)
        ("zb06e" nil)		;; 	(未使用)
        ("zb06f" nil)		;; 	(未使用)
        ("zb070" nil)		;; 	(未使用)
        ("zb071" nil)		;; 	(未使用)
        ("zb072" nil)		;; 	(未使用)
        ("zb073" nil)		;; 	(未使用)
        ("zb074" nil)		;; 	(未使用)
        ("zb075" nil)		;; 	(未使用)
        ("zb076" nil)		;; 	(未使用)
        ("zb077" "㏋")		;;  	HP
        ("zb078" nil "(〒)")	;; 	▽〒
        ("zb079" nil "(〒)")	;; 	○〒

        ;; CJK拡張漢字A *-JIS2004にある文字					
        ("za577" "㡜")		;;  	(Ext-A)*
        ("za62e" "㸅")		;;  	(Ext-A)*
        ("za85e" "䟽")		;;  	(Ext-A)*
        ("za86d" "䥫")		;;  	(Ext-A)
        ("za940" "㮶")		;;  	(Ext-A)*
        ("zaa2f" "䈇")		;;  	(Ext-A)*
        ("zaa30" "䇮")		;;  	(Ext-A)*
        ("zac49" "䯊")		;;  	(Ext-A)*
        ("zac4f" "䳑")		;;  	(Ext-A)*
        ("zad57" "㾮")		;;  	(Ext-A)*
        ("zae50" "㐂")		;;  	(Ext-A)*

        ;; CJK拡張漢字B *-JIS2004にある文字					
        ("za548" "𠵅")		;;  	(Ext-B)*
        ("za54c" "𠺕")		;;  	(Ext-B)*
        ("za554" "𡝂")		;;  	(Ext-B)*
        ("za55b" "𡑮")		;;  	(Ext-B)*
        ("za56c" "𡱖")		;;  	(Ext-B)*
        ("za57e" "𢷡")		;;  	(Ext-B)*
        ("za648" "𤂖")		;;  	(Ext-B)*
        ("za73f" "𣑊")		;;  	(Ext-B)*
        ("za751" "𣏕")		;;  	(Ext-B)*
        ("za756" "𨗈")		;;  	(Ext-B)*
        ("za772" "𥄢")		;;  	(Ext-B)*
        ("za776" "𥉁")		;;  	(Ext-B)
        ("za77b" "𧘱")		;;  	(Ext-B)*
        ("za829" "𥻨")		;;  	(Ext-B)*
        ("za82a" "𦀌")		;;  	(Ext-B)*
        ("za83f" "𧏛")		;;  	(Ext-B)*
        ("za842" "𪆐")		;;  	(Ext-B)*
        ("za848" "𪃹")		;;  	(Ext-B)*
        ("za94b" "𣜌")		;;  	(Ext-B)*
        ("za976" "𧚄")		;;  	(Ext-B)*
        ("zaa2a" "𥫱")		;;  	(Ext-B)*
        ("zaa48" "𥿠")		;;  	(Ext-B)*
        ("zaa55" "𧐐")		;;  	(Ext-B)*
        ("zaa6a" "𨵦")		;;  	(Ext-B)
        ("zaa6d" "𨫤")		;;  	(Ext-B)*
        ("zab5a" "𢏳")		;;  	(Ext-B)
        ("zab71" "𤭯")		;;  	(Ext-B)*
        ("zab73" "𤚥")		;;  	(Ext-B)*
        ("zac26" "𥝱")		;;  	(Ext-B)*
        ("zac30" "𦨞")		;;  	(Ext-B)*
        ("zac53" "𪀚")		;;  	(Ext-B)*
        ("zad24" "𦬇")		;;  	(Ext-B)
        ("zad51" "𧉫")		;;  	(Ext-B)
        ("zad59" "𤸎")		;;  	(Ext-B)*
        ("zad62" "𨏍")		;;  	(Ext-B)*
        ("zad69" "𩊱")		;;  	(Ext-B)*
        ("zad6a" "𩊠")		;;  	(Ext-B)*
        ("zad6e" "𩸭")		;;  	(Ext-B)
        ("zad73" "𩸽")		;;  	(Ext-B)*
        ("zad78" "𩺊")		;;  	(Ext-B)*

        ;; 不明文字					
        ("za557" nil)		;;  	
        ("za56e" nil)		;;  	ささてんぼだい
        ("za67a" "𫈇")		;; 	&M065576;
        ("za739" nil)		;;  	
        ("za752" nil)		;;  	
        ("za840" nil)		;;  	
        ("za84d" nil)		;;  	
        ("za85b" "𫒒")		;; 	&M065817;
        ("zab4b" nil)		;;  	彖 
        ("zac31" "𫇜")		;; 	&M065553;
        ("zac7c" nil)		;;  	
        ("zac7e" nil)		;;  	
        ("zad6c" "𫙧")		;; 	&M066003;
        ("zae2b" nil "⿰鹿子")	;;	&M066106;
      )))
  (defconst daijirin-gaiji-table
    (lookup-new-gaiji-table
     (mapcar 
      '(lambda (x)
        (list
         (if (eq lookup-support-agent 'ndtp)
             (concat "gaiji:" (car x))
           (car x))
         (cadr x)))
      encoded-daijirin-gaiji-table))))

(setq lookup-support-options
      (list ':gaiji-table daijirin-gaiji-table))

(require 'lookup)

;;; support-daijirin.el ends here
