;;; support-jitsuu.el --- suport file for "字通"
;; Copyright (C) 2009 KAWABATA Taichi <kawabata.taichi@gmail.com>

;; This program is free software; you can redistribute it and/or
;; modify it under the terms of the GNU General Public License
;; as published by the Free Software Foundation; either version 2
;; of the License, or (at your option) any later version.

;; This program is distributed in the hope that it will be useful,
;; but WITHOUT ANY WARRANTY; without even the implied warranty of
;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
;; GNU General Public License for more details.

;; You should have received a copy of the GNU General Public License
;; along with this program; if not, write to the Free Software Foundation,
;; Inc., 59 Temple Place, Suite 330, Boston, MA  02111-1307  USA

;;; Code:

(require 'lookup)

(let 
  ((encoded-jitsuu-gaiji-table
    '(
      ("H1-41" "ə")
      ("H1-42" "ā")
      ("H1-43" "ī")
      ("H1-44" "ṃ")
      ("H1-45" "ṇ")
      ("H1-46" "ô")
      ("H1-47" "ś")
      ("H1-48" "ṣ")
      ("H1-49" "ū")
      ("11-4E0B" "延󠄂")
      ("11-4E15" "擲󠄀")
      ("11-4E21" "釣󠄁")
      ("11-4ED8" "揃󠄁")
      ("11-4EE5" "韋") ;; 旧字
      ("11-4EEE" "炎") ;; 旧字
      ("11-4F5C" "勤󠄁")
      ("11-4F6F" "顚")
      ("11-4F7F" "遇󠄁")
      ("11-4FD8" "途󠄁")
      ("11-4FDA" "都󠄀")
      ("11-5012" "宵󠄁")
      ("11-5016" "及󠄁")
      ("11-5019" "丩")
      ("11-50AD" "談") ;; 旧字
      ("11-5141" "𠃉")
      ("11-5146" "酌󠄁")
      ("11-5150" "荊")
      ("11-51A5" "退󠄁")
      ("11-51EA" "城󠄁")
      ("11-51F0" "道󠄁")
      ("11-524C" "德")
      ("11-5270" "娛")
      ("11-5287" "起󠄁")
      ("11-529F" "舊") ;; 旧字
      ("11-52C7" "淡") ;; 旧字
      ("11-52C9" "麤")
      ("11-52DE" "內")
      ("11-52E0" "難󠄀")
      ("11-52E7" "海")
      ("11-530F" "寧󠄀")
      ("11-5315" "甯")
      ("11-5353" "資󠄁")
      ("11-5369" "派󠄂")
      ("11-53CD" "淸")
      ("11-53DB" "盛󠄁")
      ("11-541D" "梅󠄀")
      ("11-5486" "薄󠄁") ;; 旧字
      ("11-54B3" "化󠄁")
      ("11-54ED" "八󠄁")
      ("11-559C" "槪󠄁")
      ("11-55B0" "𥳑")
      ("11-5614" "飯󠄀")
      ("11-562F" "挽󠄁")
      ("11-566C" "晚")
      ("11-57A2" "汲󠄁")
      ("11-5834" "誤󠄁")
      ("11-583D" "畢") ;; 旧字
      ("11-5858" "稱󠄁")
      ("11-587E" "硏")
      ("11-58C1" "疏") ;; 旧字
      ("11-58CA" "往󠄁")
      ("11-5910" "瓢") ;; 旧字
      ("11-592C" "病")
      ("11-5960" "貧󠄁")
      ("11-5A36" "父󠄁")
      ("11-5ABD" "負󠄂")
      ("11-5C0D" "覆󠄁")
      ("11-5C5E" "支") ;; 旧字
      ("11-5D1F" "文󠄁")
      ("11-5D4E" "平󠄁")
      ("11-5D5C" "分󠄁")
      ("11-5E74" "神󠄀")
      ("11-5E97" "所󠄁")
      ("11-5ED6" "撆")
      ("11-5EFC" "秦")
      ("11-5F09" "扁󠄁")
      ("11-5F15" "溢󠄁")
      ("11-5F6B" "若") ;; 旧字
      ("11-5F85" "茨󠄁") ;; 旧字
      ("11-600F" "莫") ;; 旧字
      ("11-6026" "暮") ;; 旧字
      ("11-6028" "醞")
      ("11-6063" "芳") ;; 旧字
      ("11-6065" "識") ;; 旧字
      ("11-606B" "抱󠄁")
      ("11-60C5" "丂")
      ("11-60D8" "逢󠄁")
      ("11-6108" "達󠄁")
      ("11-610F" "葦") ;; 旧字
      ("11-611B" "疴")
      ("11-615F" "亡󠄁")
      ("11-61BA" "望󠄂")
      ("11-61C6" "茫") ;; 旧字
      ("11-61C8" "茆") ;; 旧字
      ("11-620A" "巢")
      ("11-6212" "橫")
      ("11-62C6" "翻󠄁")
      ("11-62CF" "奔") ;; 旧字
      ("11-6308" "邁󠄀")
      ("11-634D" "萬") ;; 旧字
      ("11-6369" "夢") ;; 旧字
      ("11-63C6" "明󠄁")
      ("11-6469" "賊󠄁")
      ("11-64D4" "凡󠄁")
      ("11-64FE" "公󠄁")
      ("11-6518" "藥") ;; 旧字
      ("11-6572" "輸󠄁")
      ("11-6588" "舞") ;; 旧字
      ("11-659B" "有󠄁")
      ("11-65A1" "菴") ;; 旧字
      ("11-661C" "猶󠄁")
      ("11-6644" "遊󠄁")
      ("11-66A2" "主󠄁")
      ("11-66AB" "虞󠄁")
      ("11-66FD" "斎󠄁")
      ("11-6703" "唐󠄁")
      ("11-6715" "終󠄁")
      ("11-6736" "遙󠄀")
      ("11-6761" "交󠄁")
      ("11-6763" "樣")
      ("11-67F1" "謝") ;; 旧字
      ("11-6867" "薛") ;; 旧字
      ("11-6897" "糗")
      ("11-68D7" "落") ;; 旧字
      ("11-699B" "𣐊")
      ("11-69B4" "流") ;; 旧字
      ("11-6A02" "龍󠄂")
      ("11-6ABB" "遼󠄁")
      ("11-6B1D" "堙")
      ("11-6B64" "恐󠄁")
      ("11-6B79" "淚")
      ("11-6B83" "類󠄀")
      ("11-6B8B" "空󠄁")
      ("11-6BAB" "戾")
      ("11-6BBB" "過󠄁")
      ("11-6C4E" "聖󠄁") ;; 聖の下は「𡈼」
      ("11-6CBB" "嵆")
      ("11-6CBF" "薀")
      ("11-6CDD" "連󠄀")
      ("11-6CEA" "練󠄀")
      ("11-6CF3" "韻") ;; 旧字
      ("11-6DB8" "浪") ;; 旧字
      ("11-6DBC" "朝󠄁")
      ("11-6E2E" "壟") ;; 旧字
      ("11-6E76" "籠") ;; 旧字
      ("11-6ECB" "卿󠄀")
      ("11-6F0F" "鄭󠄁")
      ("11-6F54" "揆󠄁")
      ("11-7058" "情󠄁")
      ("11-70C8" "帝󠄁")
      ("11-7167" "孤") ;; 旧字
      ("11-723A" "磔󠄁")
      ("11-7267" "造󠄁")
      ("11-72AF" "誠󠄁")
      ("11-7396" "還󠄁")
      ("11-73ED" "靖󠄁")
      ("11-751A" "黃")
      ("11-754B" "愈󠄁")
      ("11-7562" "說")
      ("11-75F4" "𠮟")
      ("11-7897" "翟󠄀")
      ("11-7956" "歲")
      ("11-79BF" "蕭") ;; 旧字
      ("11-79FB" "遺󠄁")
      ("11-7A3C" "煙") ;; 旧字
      ("11-7A7A" "觀") ;; 旧字
      ("11-7A92" "射") ;; 旧字
      ("11-7B49" "象") ;; 旧字
      ("11-7B94" "衰") ;; 旧字
      ("11-7C95" "醉")
      ("11-7D10" "絕")
      ("11-7D76" "曶")
      ("11-7DF4" "啼") ;; 旧字
      ("11-805E" "前󠄁")
      ("11-8105" "寒󠄁")
      ("11-8133" "進󠄁")
      ("11-817F" "視󠄁")
      ("11-82D3" "通󠄁")
      ("11-83D3" "遠󠄁")
      ("11-84CB" "花󠄁")
      ("11-852D" "乚")
      ("11-85E9" "醒")
      ("11-865E" "韓󠄁")
      ("11-878D" "簞")
      ("11-87F9" "音󠄁")
      ("11-8840" "期󠄁")
      ("11-8846" "月󠄁")
      ("11-8853" "兼󠄁")
      ("11-8A2A" "遭󠄁")
      ("11-8B01" "蔚") ;; 旧字
      ("11-8CB7" "訊󠄁")
      ("11-8FE9" "食󠄁")
      ("11-8FEB" "遂󠄂")
      ("11-9001" "餐󠄁")
      ("11-9010" "者󠄁")
      ("11-904D" "蘇") ;; 旧字
      ("11-91CC" "宁")
      ("11-920D" "丈󠄁")
      ("11-920E" "家") ;; 旧字
      ("11-95A5" "靑")
      ("11-969C" "顧󠄁")
      ("11-96FB" "諸󠄀")
      ("11-9756" "諾") ;; 旧字
      ("11-9818" "嘲󠄁")
      ("11-985B" "署󠄀")
      ("11-985E" "朕󠄂")
      ("11-98DF" "巷󠄁")
      ("11-9AEA" "成󠄁")
      ("11-9CE5" "臭󠄁")
      ("11-9EBA" "頹")
      ("11-9F3B" "屑󠄁")
      ("12-5EF6" "儞")
      ("12-610F" "乀")
      ("12-673A" "娀")
      ("12-6C99" "栳")
      ("12-8A70" "孒")
      ("13-63E1" "⌺")
      ("13-82A6" "〻")
      ;; ("11-6583" "又") ;; 旧字
      )))
  (setq ndjitsuu-gaiji-table
    (lookup-new-gaiji-table
     encoded-jitsuu-gaiji-table)))

;;; support-jitsuu.el ends here
